[{
	"name": "upstairs_hallway",
	"item_setup_dict": {
        "alarm": "An ALARM is positioned on the wall between the bedrooms and ",
        "large_poster": "a LARGE POSTER is between the doors in the SOUTH wall."
    },
	"short_description": "You are in the upstairs hallway, with ",
	"article": "the",
	"long_description": "The upstairs hallway extends down the length of the floor with stairs on either side, one set in the EAST wall leading back down to the DOWNSTAIRS HALLWAY ending and another in the WEST wall that go to the ATTIC.   The darkness of the hallway leaves you feeling uneasy.  Unlike the downstairs which had felt almost deserted, you have the feeling you are not entirely alone on this floor.\n\nThe two doors in the NORTH wall lead to a MAIN BEDROOM and a GUEST BEDROOM while the two doors in the SOUTH wall lead to a STUDY and a HOME GYM.  You can hear faint whimpering sounds coming from the STUDY.  Between the doors of the SOUTH wall hangs a LARGE POSTER.  It hangs at eye level and takes up a significant portion of the wall between the doors.  In contrast, a smaller ALARM is set between the two NORTH doors.",
	"display_name": "UPSTAIRS HALLWAY",
	"room_list": [{
		"known_to_player": true,
		"narrative_text": "stairs in the EAST wall leading down to the DOWNSTAIRS HALLWAY and ",
		"article": "the",
		"room_name": "downstairs_hallway",
		"direction": "EAST"
	},{
		"known_to_player": true,
		"narrative_text": "stairs in the WEST wall leading up to the ATTIC. There are four doors total. ",
		"article": "the",
		"room_name": "attic",
		"direction": "WEST"
	},{
		"known_to_player": true,
		"narrative_text": "The door in the NORTHWEST wall goes to the MAIN BEDROOM and ",
		"article": "the",
		"room_name": "main_bedroom",
		"direction": "NORTHWEST"
	},{
		"known_to_player": true,
		"narrative_text": "the door in the NORTHEAST wall goes to the GUEST BEDROOM while ",
		"article": "the",
		"room_name": "guest_bedroom",
		"direction": "NORTHEAST"
	},{
		"known_to_player": true,
		"narrative_text": "the door in the SOUTHWEST wall goes to the STUDY and ",
		"article": "the",
		"room_name": "study",
		"direction": "SOUTHWEST"
	},{
		"known_to_player": true,
		"narrative_text": "the door in the SOUTHEAST wall goes to a HOME GYM.",
		"article": "a",
		"room_name": "home_gym",
		"direction": "SOUTHEAST"
	}]
}]