[{
	"name": "notepad",
	"display_name": "NOTEPAD",
	"article": "the",
	"description": "The NOTEPAD is blank.",
	"type": "Inventory"
}, {
	"name": "glove",
	"display_name": "GLOVE",
	"article": "a",
	"description": "The GLOVE is in good shape and is made of flexible faux leather.",
	"type": "Inventory",
    "events": {
		"WEAR": {
			"events": ["print You are now wearing the glove."]
		}
	}
}, {
	"name": "letter",
	"display_name": "LETTER",
	"article": "the",
	"description": "The LETTER reads,\n\nDear Tuck,\nPlease come home.  I feel like I go weeks without seeing you.  For what?  You said yourself that no one would find the way in unless they were looking for it.  The least these people could do is give you a decent place to rest while you’re here.  You should be home with your family.  We can find another way.  Come home.\n\nYours,\nCarole",
	"type": "Inventory"
}, {
	"name": "sword",
	"display_name": "SWORD",
	"article": "the",
	"description": "The hilt of the SWORD is etched with two dragons and the blade has a string of kanji going down one side.  It is light and effortless to swing.",
	"type": "Inventory",
    "events": {
		"USE": {
			"events": ["print You swing the blade, but it has been dulled and is nothing more than decorative at this point."]
		},
		"FIGHT,GUARD": {
			"events": ["print You swing the SWORD, but when it hits Tuck, you find that the blade has been dulled and is nothing more than decorative at this point.  It leaves nothing more than a bruise.  He shakes his head at your attempt before knocking you out.", "game over"]
			}
	}
}, {
	"name": "burnt_note",
	"display_name": "BURNT NOTE",
	"article": "a",
	"description": "Most of the note has been burned beyond recognition, but you think you make out the letters Y - E - E - T.",
	"type": "Inventory"
}, {
	"name": "fast_food",
	"display_name": "FAST FOOD",
	"article": "the",
	"description": "There are reheated nuggets in a cardboard box.",
	"type": "Inventory",
    "events": {
		"EAT": {
			"events": ["print The FAST FOOD tastes cold and leaves you feeling hungrier than you were before."]
		}
	}
}, {
	"name": "apples",
	"display_name": "APPLES",
	"article": "the",
	"description": "Shiny, bright red apples",
	"type": "Inventory",
    "events": {
		"EAT": {
			"events": ["print You take a bite of the brightest red APPLE from the basket.  As you chew, you suddenly feel dizzy.  While your vision goes dark, you realize: the APPLE was poisoned.", "game over"]
			}
		}
}, {
	"name": "small_pouch",
	"display_name": "SMALL POUCH",
	"article": "the",
	"description": "The SMALL POUCH is small enough to fit in your pocket, but it contains a handful of bills rolled up.  It is not the large score you are after, but it is something to add to the pile.",
	"can_take": false,
	"type": "Inventory"
}, {
	"name": "key",
	"display_name": "KEY",
	"article": "the",
	"description": "A small key.",
	"type": "Inventory"
}, {
	"name": "portable_radio",
	"display_name": "PORTABLE RADIO",
	"article": "the",
	"description": "Picking up the PORTABLE RADIO, you see that it’s tuned to an easy listening station.",
	"type": "Inventory",
    "events": {
		"TURN ON": {
			"events": ["print A piano melody begins playing from the radio as it turns on.  The music plays for a few minutes before the dog starts circling and curls up in a corner.", "change dog display_name to `CALM DOG`", "change silver_key can_take to true"]
			}
		}
}, {
	"name": "bottle",
	"display_name": "BOTTLE",
	"article": "a",
	"description": "An unmarked bottle of pills",
	"type": "Inventory",
    "events": {
		"OPEN": {
			"events": ["print You open the bottle of pills to find a PILL inside.  You wonder what it does."]
			}
		}
}, {
	"name": "pill",
	"display_name": "PILL",
	"article": "a",
	"description": "An unmarked white pill.  What could this be for?",
	"type": "Inventory",
    "events": {
		"SWALLOW": {
			"events": ["print You swallow one of the unmarked pills.  You continue walking around for a bit before the house seems like it’s moving in a circle.  Colors pop out at you in bright detail and you swear you hear a dragon snarling in a nearby room.  The next thing you know the floor is rushing up at you and hits your head, knocking you out.  You wake up hours later with a dry mouth and find yourself in a jail cell.", "game over"]
			}
		}
}, {
	"name": "silver_key",
	"display_name": "SILVER KEY",
	"article": "a",
	"description": "This key looks like it is made for something more than an ordinary door.",
	"can_take": false,
	"type": "Inventory",
    "events": {
		"USE,LOCKBOX": {
			"events": ["print You use the SILVER KEY to open the LOCKBOX.  Inside are JEWELS and GOLD for the taking! Take it back to your town and use it to give back to your community.  You succeeded in becoming a modern-day Robin Hood.", "game win"]
			}
		}
}, {
	"name": "cash",
	"display_name": "CASH",
	"article": "the",
	"description": "There must be more money than you ever expected to see in your lifetime right before your very eyes.",
	"type": "Inventory"
}, {
	"name": "gold",
	"display_name": "GOLD",
	"article": "the",
	"description": "All kinds of gold coins.  Are you a modern-day Robin Hood or a pirate?  Why not both?!",
	"type": "Inventory"
}, {
	"name": "jewels",
	"display_name": "JEWELS",
	"article": "the",
	"description": "Emeralds, Rubies, Diamonds. Oh my!",
	"type": "Inventory"
},{
    "name": "coat",
	"display_name": "COAT",
	"article": "a",
	"description": "You search the COAT for clues about the owner.  As you dig around, your hand finds a piece of paper with a LETTER written on it.",
	"type": "Scenery"
},{
    "name": "china_cabinet",
	"display_name": "CHINA CABINET",
	"article": "a",
	"description": "The CHINA CABINET is locked.  You consider the value of the dinnerware, but the risk of breaking it ends that thought.  Just as you are turning away from the cabinet, you see a SMALL POUCH jutting out of a hidden corner not easily seen through the glass.",
	"type": "Scenery",
    "events": {
		"UNLOCK": {
			"events": ["print With what?"]},
		"UNLOCK,KEY": {
			"events": ["print You unlock the china cabinet.", "change small_pouch can_take to true", "change china_cabinet description to `The CHINA CABINET is unlocked.`"]}
		}
},{
    "name": "wall_mount",
	"display_name": "WALL MOUNT",
	"article": "a",
	"description": "There are various badges hanging from the WALL MOUNT from conferences and meetings.  Hidden amongst those is a KEY.",
	"type": "Scenery"
},{
    "name": "painting",
	"display_name": "PAINTING",
	"article": "a",
	"description": "The PAINTING depicts a cave.  Through the mouth of the cave is a brilliant light.  Inside is a man, with his back to the mouth of the cave, staring at the shadows cast by the jagged rocks reaching from the floor and the ceiling behind him.",
	"type": "Scenery"
},{
    "name": "podium",
	"display_name": "PODIUM",
	"article": "a",
	"description": "Looking in the glass case on the PODIUM, you see a GUEST BOOK.",
	"type": "Scenery"
},{
    "name": "guest_book",
	"display_name": "GUEST BOOK",
	"article": "a",
	"description": "The last name entered in the GUEST BOOK you see is John Little.",
	"type": "Scenery"
},{
    "name": "chairs",
	"display_name": "CHAIRS",
	"article": "the",
	"description": "The CHAIRS appear to be normal, waiting room chairs for visitors.  They sit around a SMALL TABLE.",
	"type": "Scenery"
},{
    "name": "small_table",
	"display_name": "SMALL TABLE",
	"article": "the",
	"description": "On the SMALL TABLE is a blank NOTEPAD that appears to have had the top page hastily ripped off.",
	"type": "Scenery"
},{
    "name": "desk",
	"display_name": "DESK",
	"article": "a",
	"description": "The DESK is relatively bare.  You see a line of walkie talkies and some pens.",
	"type": "Scenery"
},{
    "name": "guard",
	"display_name": "GUARD",
	"article": "a",
	"description": "The GUARD`S badge says `Tuck`.",
	"type": "Scenery",
    "events": {
		"FIGHT": {
			"events": ["print You try to fight the guard, but you are no match for him.  He knocks you out, and when you wake, you find yourself in a jail cell.", "game over"]
		},
		"FIGHT,SWORD": {
			"events": ["print You swing the SWORD, but when it hits Tuck, you find that the blade has been dulled and is nothing more than decorative at this point.  It leaves nothing more than a bruise.  He shakes his head at your attempt before knocking you out.", "game over"]
		},
		"BRIBE,SMALL_POUCH": {
			"events": ["print Tuck raises his eyebrows at you curiously.  There’s a moment of silence between the two of you as he considers the offer.\n\n“I’m too old for this crap,” he mutters, swiping the pouch out of your hand and walking toward the door.  You listen as he stomps down the stairs before finally hearing the front door slam shut.", "change guest_bedroom special_intro to false"]
			},
		"PERSUADE,LETTER": {
			"events": ["print You remember the letter from Carole you found.  It had been addressed to someone named Tuck.  Hoping it will help you out of the situation, you offer the letter to the guard.  He narrows his gaze in suspicion at you as you fish out the paper and hand it over.  His eyes soften as he reads what’s written.\n\n“Where did you…” he starts to say.  He looks between you and the letter several times before finally sighing.  “I quit.  Hell, I’m probably out of a job anyway after falling asleep here.  As far as I’m concerned, I never saw you.”\n\nWith that, he walks out of the room.", "change guest_bedroom special_intro to false"]
			}
		}
},{
    "name": "night_stand",
	"display_name": "NIGHT STAND",
	"article": "a",
	"description": "Opening the drawer to the NIGHT STAND, you see a glove.",
	"type": "Scenery"
},{
    "name": "window",
	"display_name": "WINDOW",
	"article": "a",
	"description": "Looking out the WINDOW, you see a dark yard but the sky is slowly lightening.  You need to move along if you hope to finish your task under cover of night.",
	"type": "Scenery"
},{
    "name": "shelf",
	"display_name": "SHELF",
	"article": "a",
	"description": "You go to the SHELF and you see a PORTABLE RADIO.",
	"type": "Scenery"
},{
    "name": "mirror",
	"display_name": "MIRROR",
	"article": "a",
	"description": "As you approach the MIRROR, a loud voice yells out “Are you ready to take your workout to the next level?” in a hyped up, perky tone.  You jump in surprise before realizing that this is one of the smart mirrors that you can watch while working out.  The screen on the MIRROR flickers on to show a pre-recorded personal trainer and a list of workouts to begin.",
	"type": "Scenery"
},{
    "name": "microwave",
	"display_name": "MICROWAVE",
	"article": "a",
	"description": "The MICROWAVE emits an occasional beep.  You try to peer in the dark door, seeing a small container of FAST FOOD sitting in the middle for reheating.  You put your hand on the door.  It is cool to the touch.",
	"type": "Scenery"
},{
    "name": "island",
	"display_name": "ISLAND",
	"article": "an",
	"description": "Going over to the ISLAND, you see a bowl of fruit with vibrant red APPLES and a BLUE JAR with a paw print on it.",
	"type": "Scenery"
},{
    "name": "blue_jar",
	"display_name": "BLUE JAR",
	"article": "a",
	"description": "You pull back the lid on the BLUE JAR to find MILK BONES that smell strongly of bacon.",
	"type": "Scenery"
},{
    "name": "milk_bone",
	"display_name": "MILK BONE",
	"article": "the",
	"description": "Milk bone dog treats",
	"type": "Inventory"
},{
    "name": "fireplace",
	"display_name": "FIREPLACE",
	"article": "the",
	"description": "The FIREPLACE has a thin line of ash around the bottom that makes you think it has been used recently but the lack of warmth indicates that whoever used it is probably gone by now.  You are just about to turn away from the FIREPLACE when you see a BURNT NOTE stuck between the bottom logs.",
	"type": "Scenery"
},{
    "name": "paper",
	"display_name": "STRIP OF PAPER",
	"article": "a",
	"description": "As you look closer at the STRIP OF PAPER, you notice that it is a receipt from John Little’s Lock & Key.",
	"type": "Scenery"
},{
    "name": "alarm",
	"display_name": "ALARM",
	"article": "an",
	"description": "The alarm appears to be quite old and outdated.  You are not even sure it’s fully mounted into the wall or whether it is simply hanging like a photo would be.  There is a RED BUTTON on the alarm.  Should you press it?",
	"type": "Scenery",
    "events": {
		"INSERT": {
			"events": ["print Nothing happens."]}
		}
},{
    "name": "large_poster",
	"display_name": "LARGE POSTER",
	"article": "a",
	"description": "You see a poster of the night sky.  You search the poster trying to figure out what its meaning is when you recognize the bright star Vega, and from there, you trace the constellation Lyra in your mind.",
	"type": "Scenery"
},{
    "name": "red_button",
	"display_name": "RED BUTTON",
	"article": "a",
	"description": "A big shiny RED BUTTON",
	"type": "Scenery",
    "events": {
		"PRESS": {
			"events": ["print You stand frozen in place waiting for something to happen after pressing the button.  Finally after several seconds of holding your breath in anticipation, you let out a sigh of relief that nothing happened.  No good comes from pressing red buttons, you remind yourself.  And yet, when presented with one, it’s hard to resist the temptation."]
			}
		}
},{
    "name": "dog",
	"display_name": "ANGRY DOG",
	"article": "a",
	"description": "You approach the DOG carefully.  As you get closer, it bares its teeth in warning.  Suddenly, it shakes its head as if shaking off some irritation and you notice a SILVER KEY hanging from the collar where a tag would be.  Is there way to soothe this savage beast to get the key?",
	"type": "Scenery",
    "events": {
		"FEED,MILK_BONE": {
			"events": [
				"print You slip a milk bone to the DOG through the bars of the CRATE.  It takes it carefully, keeping its eyes on you while it chews.  When it finishes, it wags its tail before curling up in the corner to lie down.",
				"change dog display_name to `CALM DOG`",
				"change silver_key can_take to true"]
		},
		"TURN ON,PORTABLE_RADIO": {
			"events": [
				"print A piano melody begins playing from the radio as it turns on.  The music plays for a few minutes before the dog starts circling and curls up in a corner.",
				"change dog display_name to `CALM DOG`",
				"change silver_key can_take to true"]
		}
	}
},{
    "name": "crate",
	"display_name": "CRATE",
	"article": "a",
	"description": "There’s a sliding latch on the wireframe crate.",
	"type": "Scenery",
    "events": {
		"OPEN": {
			"events": ["print The DOG ignores you and stays sleeping."]
			}
		}
},{
    "name": "bed",
	"display_name": "BED",
	"article": "a",
	"description": "The BED is covered in a comforter that feels softer than any other you’ve seen when you press your hand into it.  The bed was decked out for a king with drapes that could be drawn around with the richest fabrics on it.",
    "type": "Scenery"
},{
    "name": "waste_basket",
	"display_name": "WASTE BASKET",
	"article": "a",
	"description": "The WASTE BASKET is empty.",
	"type": "Scenery"
},{
    "name": "medicine_cabinet",
	"display_name": "MEDICINE CABINET",
	"article": "a",
	"description": "The MEDICINE CABINET looks to be the kind with a mirror on front and a front-facing door that swings open.",
	"type": "Scenery",
    "events": {
		"OPEN": {
			"events": ["print You open the MEDICINE CABINET and see various toiletries and vitamins.  There is a single unmarked BOTTLE on a shelf"]
		}
	}
},{
    "name": "trunk",
	"display_name": "TRUNK",
	"article": "a",
	"description": "The TRUNK is old and sturdy.  It has no lock.",
	"type": "Scenery",
    "events": {
		"OPEN": {
			"events": ["print School awards and trophies are stacked inside the TRUNK.  You see some for science projects and others for academic decathlons."]
			}
		}
},{
    "name": "bookcase",
	"display_name": "BOOKCASE",
	"article": "a",
	"description": "Numerous books fill the BOOKCASE in front of you.  You see books like GULLIVER’S TRAVELS, THE ODYSSEY, and CRIME AND PUNISHMENT and more modern works like NINETEEN EIGHTY-FOUR and even HITCHHIKER’S GUIDE TO THE GALAXY.",
	"type": "Scenery"
},{
    "name": "gulliver_travels",
	"display_name": "GULLIVER`S TRAVELS",
	"article": "the",
	"description": "A normal copy of Gulliver`s Travels",
	"type": "Scenery"
},{
    "name": "crime_and_punishment",
	"display_name": "CRIME AND PUNISHMENT",
	"article": "the",
	"description": "A normal copy of Crime and Punishment",
	"type": "Scenery"
},{
    "name": "nineteen_eighty-four",
	"display_name": "NINETEEN EIGHTY-FOUR",
	"article": "the",
	"description": "A normal copy of Nineteen Eighty-Four",
	"type": "Scenery"
},{
    "name": "hitchhikers_guide_to_the_galaxy",
	"display_name": "HITCHHIKER`S GUIDE TO THE GALAXY",
	"article": "the",
	"description": "A normal copy of Hitchhiker`s Guide to the Galaxy",
	"type": "Scenery"
},{
    "name": "odyssey",
	"display_name": "ODYSSEY",
	"article": "the",
	"description": "As you look at the copy of the ODYSSEY, you notice that it is sticking out more than the other books.  You wonder if you should pull it off the shelf.",
	"type": "Scenery",
	"events": {
		"PICK UP": {
			"events": ["print As you try to pull the ODYSSEY, it catches on something and you hear a click. The BOOKCASE slides to the side revealing a walk-in SAFE with a KEYPAD.", "change attic.direction.north narrative_text to `The BOOKCASE slides to the side revealing a walk-in safe with a KEYPAD.`"]
			}
		}
},{
    "name": "keypad",
	"display_name": "KEYPAD",
	"article": "the",
	"description": "A digital KEYPAD with numbers 0-9",
	"type": "Scenery",
    "events": {
		"INSERT": {
			"events": ["print $$verb what?"]
			},
		"INSERT 9338": {
			"events": ["print You enter the digits into the KEYPAD.  The door unlocks and starts to swing out.  You have unlocked a HIDDEN ROOM and can enter the SAFE.", "move player to safe"]
			},
		"INSERT YEET": {
			"events": ["print You enter the digits into the KEYPAD.  The door unlocks and starts to swing out.  You have unlocked a HIDDEN ROOM and can enter the SAFE.", "move player to safe"]
		}
	}
},{
    "name": "containers",
	"display_name": "CONTAINERS",
	"article": "the",
	"description": "The storage CONTAINERS are filled with old family albums.  You flip through seeing pictures of a family that might once have understood the struggles you and yours currently deal with.  That struggle has long been forgotten by them.",
	"type": "Scenery"
},{
    "name": "electronics",
	"display_name": "ELECTRONICS",
	"article": "the",
	"description": "You look through the ELECTRONICS piled in the little attic closet.  You see old consoles and handheld units from Atari to Gameboy.  You can still recall playing some of these and you remember the games fondly.",
	"type": "Scenery"
},{
    "name": "lockbox",
	"display_name": "LOCKBOX",
	"article": "a",
	"description": "A separate LOCKBOX is stored inside the safe.  It is still locked even though the safe is open.  How do you get in there?",
	"type": "Scenery",
    "events": {
		"UNLOCK,SILVER_KEY": {
			"events": ["print You use the SILVER KEY to open the LOCKBOX.  Inside are JEWELS and GOLD for the taking! Take it back to your town and use it to give back to your community.  You succeeded in becoming a modern-day Robin Hood.", "game win"]
			}
		}
}]